{
  "backend/main.mo": "Motoko backend actor defining product, category, user, and purchase types with storage, authorization, and Stripe integration, plus CRUD operations for products and profiles.",
  "feature_evidence.json": "Feature evidence report listing two features related to generating a custom product image and updating demo data to reference it.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, pages, hooks, and styles.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using OKLCH tokens and global style application.",
  "frontend/index.html": "Main HTML entry file setting metadata, favicon links, root mount point, and script loader for the React app.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router, layout, theme provider, modals, and user profile detection.",
  "frontend/src/components/admin/ProductDigitalDownloadDialog.tsx": "Dialog for uploading, updating, or removing a product’s digital download file with progress tracking.",
  "frontend/src/components/DemoDataSeeder.tsx": "Admin-only utility component that seeds categories, demo products with images and INR pricing, hero banner, and brand story content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, categories, and social icons.",
  "frontend/src/components/Header.tsx": "Provides the main site header with navigation, authentication handling, and admin/user-specific links.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to enter and save their name for profile setup.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe secret key and allowed countries when Stripe is not yet set up.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context and helpers using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, admin status, homepage content, products, and related entities via an actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and custom utility classes for premium UI styles.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page displaying the brand story, values, and imagery for Digi Store.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard allowing authenticated admins to manage hero banners, brand stories, products, categories, and digital downloads.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with company contact details and a form that simulates message submission with toast notifications.",
  "frontend/src/pages/DownloadsPage.tsx": "Displays a user's digital downloads, handling login state, loading states, and rendering purchased downloadable products.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, featured products, and loading placeholders based on fetched CMS data.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with common issues and navigation options back to the shop or support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes successful payments, records digital purchases, and shows available downloads once processing is complete.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with purchase flow, loading state, and fallback for missing products.",
  "frontend/src/pages/ShopPage.tsx": "Provides product browsing with search, category filters, loading states, and a grid of product cards.",
  "frontend/src/utils/productImage.ts": "Utility to safely extract a product image URL from an ExternalBlob array with error handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove them from the URL when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and container settings to support the app’s design theme.",
  "project_state.json": "Stores the project’s state, requirements, and feature list related to building a kids‑worksheets digital product app."
}