{
  "backend/main.mo": "Main backend actor implementing storage, authorization, product management, user profiles, digital purchases, and Stripe integration.",
  "backend/migration.mo": "Migration module converting old product records to the new schema by adding a null digitalDownload field.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for digital product support and customer downloads flow.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base configuration defining CSS variables and themes for light and dark modes.",
  "frontend/index.html": "HTML entry file providing the root container and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up router, layout, authentication checks, profile setup, Stripe setup modal, and theme provider.",
  "frontend/src/components/admin/ProductDigitalDownloadDialog.tsx": "Provides a dialog for uploading, editing, or removing a product’s digital download file and settings.",
  "frontend/src/components/DemoDataSeeder.tsx": "Admin-only tool that seeds demo categories, products, hero banner, and brand story content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, navigation links, categories, social icons, and a bottom bar.",
  "frontend/src/components/Header.tsx": "Implements the site header with navigation, authentication handling, admin links, and a responsive mobile menu.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting the user to enter and save their name during initial profile setup.",
  "frontend/src/components/StripeSetupModal.tsx": "Shows an admin-only modal for configuring Stripe payment settings, including secret key and allowed countries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, managing login state, identity loading, and logout behavior.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, admin checks, homepage content, and product CRUD operations.",
  "frontend/src/index.css": "Tailwind setup defining light/dark vibrant color themes and utility classes for gradients and UI styling.",
  "frontend/src/main.tsx": "Initializes React app root with React Query provider and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page with story, values, and themed visuals using vibrant gradient styles.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard enabling hero banner, brand story, product, and category management with identity and admin checks.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with basic validation and static contact info using vibrant UI components.",
  "frontend/src/pages/DownloadsPage.tsx": "Displays a user's purchased digital products, handling login state, loading states, and linking purchases to downloadable items.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content and featured products, showing skeletons while loading dynamic CMS content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with common issues and options to return to the shop or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes successful payments by recording digital purchases, then displays confirmation and available downloads.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info with images and purchase flow, including checkout session creation for logged‑in users.",
  "frontend/src/pages/ShopPage.tsx": "Lists products with search and category filtering, showing skeletons while loading and handling empty results.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from session or URL.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, breakpoints, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Tracks project state, requirements, existing features, and pending feature requests for a digital kids-worksheets product catalog."
}