{
  "kind": "build_request",
  "title": "Ensure product creation works end-to-end (Admin add product -> visible in Shop/Product pages)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Make the \"Add New Product\" flow fully functional end-to-end so an admin can add a product from the Admin page and the newly created product reliably appears in the \"Existing Products\" list and is visible in the Shop page and Product Detail page without requiring a manual refresh or reseeding.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "add product"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as an admin, creating a product from Admin → Products → Add New Product succeeds and shows the success toast in English.",
        "After adding a product, the new product appears in the Admin page \"Existing Products\" list within a few seconds (React Query refetch/invalidation works) without a full page reload.",
        "After adding a product, navigating to the Shop page shows the new product in the product grid (and it is searchable/filterable like other products).",
        "Clicking the new product in Shop opens its Product Detail page, and the page loads the product successfully (no \"Product not found\" fallback).",
        "If the admin uploads a product image, the image renders correctly on Admin cards, Shop cards, and Product Detail; if no image is uploaded, the existing placeholder UI renders without layout breakage."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit frontend files under immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui (compose instead).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding a bulk catalog (e.g., 11,000+ products) as part of this request.",
    "Changing the Product model schema or adding new backend endpoints (unless required to fix a proven blocking issue in the existing add product flow).",
    "Implementing third-party authentication providers (only Internet Identity is supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}