{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin Add Product flow so new products appear immediately across Admin, Shop, and Product Detail",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Ensure admin-created products immediately appear in Admin Existing Products, Shop grid (searchable/filterable), and Product Detail without manual refresh; ensure uploaded images render consistently with safe fallbacks.",
      "acceptanceCriteria": [
        "When logged in as an admin, creating a product from Admin → Products → Add New Product succeeds and shows the success toast in English.",
        "After adding a product, the new product appears in the Admin page \"Existing Products\" list within a few seconds (React Query refetch/invalidation works) without a full page reload.",
        "After adding a product, navigating to the Shop page shows the new product in the product grid (and it is searchable/filterable like other products).",
        "Clicking the new product in Shop opens its Product Detail page, and the page loads the product successfully (no \"Product not found\" fallback).",
        "If the admin uploads a product image, the image renders correctly on Admin cards, Shop cards, and Product Detail; if no image is uploaded, the existing placeholder UI renders without layout breakage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden product React Query behavior to make newly added products visible immediately: update useAddProduct to (1) optimistically insert the created product into the ['products'] cache, (2) prefill the ['product', productId] cache for the created product, and (3) trigger targeted invalidate+refetch for ['products'] and related views so the Admin list and Shop grid update without reload. Keep all user-facing messages in English. If product images use ExternalBlob URLs, ensure cache updates preserve ExternalBlob instances (blob-storage component). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/productImage.ts",
          "operation": "create",
          "description": "Add a small shared helper to safely derive a primary product image URL from Product.images (ExternalBlob) with try/catch safeguards and a consistent 'no image' result to preserve existing placeholder UI. This centralizes ExternalBlob.getDirectURL usage (blob-storage component) for Admin/Shop/Detail rendering. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Wire the improved add-product behavior into the Admin → Products → Add New Product flow: after a successful mutation, rely on the updated React Query cache/refetch to update the Existing Products list quickly, and ensure the success toast remains English. Update product card image rendering to use the shared product image helper so uploaded images reliably render and placeholders remain stable. Uses ExternalBlob direct URLs (blob-storage component). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ShopPage.tsx",
          "operation": "modify",
          "description": "Update Shop product grid card image rendering to use the shared product image helper for consistent ExternalBlob URL handling; ensure products derived from the refreshed ['products'] query remain searchable/filterable without additional refresh. Uses ExternalBlob direct URLs (blob-storage component). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProductDetailPage.tsx",
          "operation": "modify",
          "description": "Improve Product Detail reliability for newly created products: ensure the page prefers cached product data when available (prefilled on add) and uses the shared product image helper for consistent rendering; keep existing placeholder UI when no image is present. Uses ExternalBlob direct URLs (blob-storage component). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}